# `importing libraries`

In [2]:
import pandas as pd
import numpy as np

# `importing dataset`

In [2]:
df = pd.read_csv('data/open_pubs.csv',header = None)

We also have a data dictionary for columns dataset information

In [3]:
data_dict = pd.read_excel('data/data_dictionary.xlsx')

In [4]:
data_dict

             Field Possible Values                                 Comments
0           fsa_id             int  Food Standard Agency's ID for this pub.
1             name          string                         Name of the pub.
2          address          string      Address fields separated by commas.
3         postcode          string                     Postcode of the pub.
4          easting             int                                      NaN
5         northing             int                                      NaN
6         latitude         decimal                                      NaN
7        longitude         decimal                                      NaN
8  local_authority          string    Local authority this pub falls under.

**Top 5 rows**

In [5]:
df.head()

,0,1,2,3,4,5,6,7,8
0,22,Anchor Inn,"Upper Street, Stratford St Mary, COLCHESTER",CO7 6LW,604749,234404,51.970379,0.979340,Babergh
1,36,Ark Bar Restaurant,"Ark Bar And Restaurant, Cattawade Street, Bran...",CO11 1RH,610194,233329,51.958698,1.057832,Babergh
2,74,Black Boy,"The Lady Elizabeth, 7 Market Hill, SUDBURY, Su...",CO10 2EA,587334,241316,52.038595,0.729915,Babergh
3,75,Black Horse,"Lower Street, Stratford St Mary, COLCHESTER",CO7 6JS,622675,-5527598,\N,\N,Babergh
4,76,Black Lion,"Lion Road, Glemsford, SUDBURY",CO10 7RF,622675,-5527598,\N,\N,Babergh

# `data wrangling`

There are no columns present in dataset. <br>

**Assigning columns names**

In [6]:
columns_names = ['fsa_id','name','address','postcode','easting','northing','latitude','longitude','local_authority'] 
df.columns = columns_names

In [7]:
df.head()

,fsa_id,name,address,postcode,easting,northing,latitude,longitude,local_authority
0,22,Anchor Inn,"Upper Street, Stratford St Mary, COLCHESTER",CO7 6LW,604749,234404,51.970379,0.979340,Babergh
1,36,Ark Bar Restaurant,"Ark Bar And Restaurant, Cattawade Street, Bran...",CO11 1RH,610194,233329,51.958698,1.057832,Babergh
2,74,Black Boy,"The Lady Elizabeth, 7 Market Hill, SUDBURY, Su...",CO10 2EA,587334,241316,52.038595,0.729915,Babergh
3,75,Black Horse,"Lower Street, Stratford St Mary, COLCHESTER",CO7 6JS,622675,-5527598,\N,\N,Babergh
4,76,Black Lion,"Lion Road, Glemsford, SUDBURY",CO10 7RF,622675,-5527598,\N,\N,Babergh

**Finding and replacing null values**

In [8]:
print((df['latitude'] == '\\N').value_counts())
print((df['longitude'] == '\\N').value_counts())

False    50564
True       767
Name: latitude, dtype: int64
False    50564
True       767
Name: longitude, dtype: int64

In [9]:
df['latitude'].replace('\\N',np.nan,inplace=True)
df['longitude'].replace('\\N',np.nan,inplace=True)

In [10]:
print((df['latitude'] == '\\N').value_counts())
print((df['longitude'] == '\\N').value_counts())

False    51331
Name: latitude, dtype: int64
False    51331
Name: longitude, dtype: int64

In [11]:
df.shape

(51331, 9)

In [12]:
df.isnull().sum()

fsa_id               0
name                 0
address              0
postcode             0
easting              0
northing             0
latitude           767
longitude          767
local_authority      0
dtype: int64

In [13]:
df.dropna(inplace=True)

In [14]:
df.shape

(50564, 9)

In [15]:
df.isnull().sum()

fsa_id             0
name               0
address            0
postcode           0
easting            0
northing           0
latitude           0
longitude          0
local_authority    0
dtype: int64

**Checking columns types**

In [16]:
df.dtypes

fsa_id              int64
name               object
address            object
postcode           object
easting             int64
northing            int64
latitude           object
longitude          object
local_authority    object
dtype: object

<code>latitude</code> and <code>longitude</code> are in wrong format.

In [19]:
df['latitude'] = df['latitude'].astype('float')
df['longitude'] = df['longitude'].astype('float')

In [20]:
df.dtypes

fsa_id               int64
name                object
address             object
postcode            object
easting              int64
northing             int64
latitude           float64
longitude          float64
local_authority     object
dtype: object

In [23]:
df.to_csv('data/cleaned_open_pubs.csv')

In [33]:
df.groupby('local_authority').count().sort_values(by = 'name',ascending=False).head()

,fsa_id,name,address,postcode,easting,northing,latitude,longitude
local_authority,,,,,,,,
County Durham,680,680,680,680,680,680,680,680
Leeds,611,611,611,611,611,611,611,611
Cornwall,557,557,557,557,557,557,557,557
Wiltshire,544,544,544,544,544,544,544,544
Kirklees,524,524,524,524,524,524,524,524

In [37]:
df.groupby('local_authority').count()['name'].sort_values(ascending=False).head()

local_authority
County Durham    680
Leeds            611
Cornwall         557
Wiltshire        544
Kirklees         524
Name: name, dtype: int64